#第1題************************************************************************#
#先輸入矩陣
D=matrix(c(9,4,525,144,64,3,16,81,49,0,64,25,4,1,0,16),nrow=4,byrow=TRUE)
D
#*************************************(a)*************************************#
#由於平方根區分正負，所以作兩次處理。
#3的平方根為非整數，设置不显示多位数，只保留一位小數。
round(D^0.5,1) #此為矩陣的每一元素的正平方根
round(-D^0.5,1) #此為矩陣的每一元素的負平方根
#*************************************(b)*************************************#
rownames(D)=c("R1","R2","R3","R4")
colnames(D)=c("C1","C2","C3","C4")
D
#*************************************(c)*************************************#
#對各列求和
##方法一
colSums(D)
###延伸，也可以用apply D代表操作对象，2代表列，1代表行
###整个式子代表对D矩阵的所有列分别求和。
apply(D,2,sum)
##方法二
sum(D[,1])
sum(D[,2])
sum(D[,3])
sum(D[,4])
##方法三
colSums=c()
for (i in 1:4){colSums[i]=sum(D[,i])}
colSums
###延伸：如果用sum(D)的话，就是把矩阵里所有元素相加求和。
###因此既可以用sum来sum每一列，也可以用colSums来找出D矩阵的每一列的和。
#對各列求平均數
##方法一
colMeans(D)
###延伸方法
apply(D,2,mean)
##方法二
mean(D[,1])
mean(D[,2])
mean(D[,3])
mean(D[,4])
##方法三
colMeans=c()  #即先定义一个名为colMeans的空变量
for (i in 1:4){colMeans[i]=mean(D[,i])}
colMeans
###延伸：如果用mean(D)则是对矩阵D里所有元素求和后求平均数。
#對各列求標準差
##方法一
sd(D[,1])   
sd(D[,2])
sd(D[,3])
sd(D[,4])
##方法二
colStd=c()
for (i in 1:4){colStd[i]=sd(D[,i])}
colStd
##方法三
apply(D,2,sd)
#*************************************(d)*************************************#
t(D)
#*************************************(e)*************************************#
E=matrix(c(-6,77,125,-13),nrow=1,byrow=TRUE)
A=rbind(D,E)
A
#*************************************(f)*************************************#
A[c(1,4,5),]
#*************************************(g)*************************************#
A[,c(1,3)]
#*************************************(h)*************************************#
A[A<=0]=1
A


#第2題************************************************************************#
#*************************************(a)*************************************#
label=c("ABC","Weiwei","Nezha","Wusong","Zubajie","Wukong","Chunli")
sex=c("Male","Female","Male","Male","Male","Male","Female")
result=c(78,100,49,99,60,98,88)
result=
  data.frame(label,sex,result)
result
#*************************************(b)*************************************#
sex=factor(sex)
str(sex)
#*************************************(c)*************************************#
result["result"]    #提取數據框內的成績變量並保有數據框的格式屬性
class(result["result"])     #據此可知提取后仍保有數據框的格式屬性
#*************************************(d)*************************************#
result[result$result>95,]
#*************************************(e)*************************************#
result[result$result>95&result$sex=="female",] #"="表示賦值,"=="表示判斷。
#*************************************(f)*************************************#
rownames(result)=label   #將各行命名為姓名
rownames(result)         #查看命名為姓名后的行名稱
result=result[,-1]       #把第一列 Labels 變量從數據框內排除
result                   #查看排除第一列Labels變量后的結果
#*************************************(g)*************************************#
crt=cut(c(78,100,49,99,60,98,88),breaks=c(0,60,70,80,100),
        labels=c("F","C","B","A"),right=FALSE)
crt   #查看結果 注：由於區間左閉右開，所以分數100不會落于任何一個區間
#*************************************(h)*************************************#
barplot(table(crt),main="Academic Performance",xlab="Grade",ylab="Frequency",
        col="lightpink",border="lightpink3") 
#如果出現 figure margins too large的警告，請調大右邊Plots的窗口，
#詳細參見https://blog.csdn.net/sanqima/article/details/51339341


#第3題************************************************************************#
#*************************************(a)*************************************#
#**********调取文件的方法一：其他文件openfile+dta文件library foreign**********#
#缺点：library读取文件很麻烦，要改路径，而且openfile无法用于做lm模型函数
library(foreign)
mydata=read.dta("D:/WAGE2.DTA")  ###非常重要！！！读取dta文件的方法！！！
###dta文件和其他不同，其他都能直接open file调取 只有dta文件需要用library(foreign)
###读取之后，为了让data文件像csv R文件一样显示在左上方的窗口，则用View(mydata)
###指令进行调取，而不是用mydata，因为用mydata的话，数据会显示在左下的指令窗口
#\是一个特殊符号，它在字符串里会自动和后面字符的连在一起，比如"\n"表示換行
#因此載入路徑要麼使用/，要麼使用\\
##会出现Warning message:
##In read.dta("D:/WAGE2.DTA") : cannot read factor labels from Stata 5 files
##直接忽略即可，对本题结果没有影响。
#**********调取文件的方法二：file-import dataset-from************************#
#优点：所有文件都可以调取，包括dta文件#
#缺点：1、文件路径名字不能太长，最好放桌面
#缺点：2、CSV无法打开，需要转成工作表文件之后再Import
##方法一
is.data.frame(mydata)  
##方法二
class(mydata)
#*************************************(b)*************************************#
tail(mydata,n=8)
#*************************************(c)*************************************#
library(psych)
describe(mydata$wage) 
#通過上行運行可計算出wage的平均數、最大值、最小值、中位數、標準差、偏度
##用系统自带的summary函数也行 ，但是只能求出最大值、最小值、
##中位数、平均数、第一分位数和第三分位数。
summary(mydata$wage)
var(wage)  #計算方差
##计算分位数，方法一
quantile(mydata$wage,.2)  #計算第20百分位數
quantile(mydata$wage,.8)  #計算第80百分位數
##计算分位数，方法二
quantile(mydata$wage,c(.2,.8))
#*************************************(d)*************************************#
describe(mydata$IQ)
#通過上行運行可計算出IQ的平均數、最大值、最小值、中位數、標準差、偏度
var(IQ)  #計算方差
quantile(IQ,.1)  #計算第10百分位數
quantile(IQ,.9)  #計算第90百分位數
#*************************************(e)*************************************#
##方法一：查看满足条件的行
mydata[mydata$educ>=16&mydata$wage>2000&mydata$IQ>120,]
##方法二：直接计算满足条件的提取行范围总共几行几列
dim(mydata[mydata$educ>=16&mydata$wage>2000&mydata$IQ>120,])
##方法三：直接计算满足条件的提取行范围总共几行
nrow(mydata[mydata$educ>=16&mydata$wage>2000&mydata$IQ>120,])
#*************************************(f)*************************************#
#求黑人的平均工資
##方法一：把满足black列的取值为1的所有部分提取出来，计算这个部分的每列的平均数
colMeans(mydata[mydata$black==1,])
##方法二：计算满足满足black列的取值为1的部分的第一列提取出来，
##仅计算第一列的平均数。
mean(mydata[mydata$black==1,1])  ##一个=代表赋值，两个==代表判断
#求非黑人的平均工資
##方法一
colMeans(mydata[mydata$black==0,])
##方法二
mean(mydata[mydata$black==0,1])
#*************************************(g)*************************************#
#方法一
summary(mydata)
#方法二
summary(mydata$married)    #相較方法一可以更方便地看到married的信息
#因為married的取值僅可為0或1，所以married的中位數為1僅能代表在群體中結婚的人數
#超過未婚的人數，除此以外不能再提供任何有用的信息。
#*************************************(h)*************************************#
class(mydata$married)
#*************************************(i)*************************************#
mydata$married=factor(mydata$married)
class(mydata$married)  #方法一
is.factor(mydata$married)  #方法二
#*************************************(j)*************************************#
#年齡的直方圖
hist(mydata$age,main="Histogram of age",xlab="age",
     col="lightskyblue1",border="black",xlim=c(26,40),ylim=c(0,150))
#結婚的直條圖
barplot(table(mydata$married),main="Married or not",ylab="Frequency",
        legend=c("Not Married","Married"),
        ylim=c(0,2000),col=c("plum2","steelblue1"))
##未知调节图例大小的方式，故通过调节ylim来避免图例遮住图形
#*************************************(k)*************************************#
plot(mydata$age,mydata$wage,xlab="age",ylab="wage",
     main="Relationship between age and wage",
     pch=5,bg="navy",col="skyblue1",cex=0.5,col.axis="red",col.lab="green",
     cex.main=0.8,col.main="pink",cex.axis=0.5)
###par(mfrow=c(1,1))表示把一张图绘制在画板上
###par(mfrow=c(2,2))表示把四张图绘制在画板上


#第4題************************************************************************#
#*************************************(a)*************************************#
x=0
for(i in 1:1000){x=x+1/i}
x
#*************************************(b)*************************************#
##方法一
SUM=function(a,r,n){x=0;expo=0
for(i in 1:n){
  x=x+a*r^expo
  expo=expo+1
}
  print(x)}
##方法二
SUM=function(a,r,n) {
  x=0
  for (i in 0:(n-1)){
    x = x + a*r^i
  }
  print(x)
}
#*************************************(c)*************************************#
SUM(100,0.99,50)
#*************************************(d)*************************************#
##> cat("n=",5)
##n= 5
##cat函数，第一个逗号前表示要输出的文字部分，第二位表示输出对象的取值。
##注：也可以没有输入对象的名称，直接写第二位，即取值。
simple_stat = function(vec){
  cat("Mean=",mean(vec),'\n')
  cat("Max=",max(vec),'\n')
  cat("Min=",min(vec),'\n')
  cat("Standard Deviation=",sd(vec),'\n')
  cat("Median=",median(vec),'\n')
}
#*************************************(e)*************************************#
simple_stat(c(2,4,6,8,10))


#第5題************************************************************************#
Solve_equation=function(a,b,c){
  Δ=(b^2-4*a*c)^(1/2)
  if(b^2-4*a*c>0){x1=(-b-Δ)/(2*a);x2=(-b+Δ)/(2*a);cat("x1 =",x1,", x 2=",x2)
  }
  else if(b^2-4*a*c==0){x1=(-b-Δ)/(2*a);cat("x1=x2=",x1)}
  else{cat("此一元二次方程沒有實數根")}}
#此函數的运行结果符合以下测试#
Solve_equation(1,1,1)    #(i)

Solve_equation(1,-6,8)   #(ii)

Solve_equation(1,-2,1)   #(iii)

#第6題************************************************************************#
#*************************************(a)*************************************#
X=rnorm(n=1000,mean=10,sd=4)
mean(X)
median(X)
#*************************************(b)*************************************#
Y=rnorm(n=1000,mean=10,sd=8^0.5)
mean(Y)
median(Y)
#*************************************(c)*************************************#
##方法一
t=((mean(X)-mean(Y))-(1000-1000))/(16/1000+8/1000)^0.5
t
if(t<1.96){cat("在95%的置信水平下，我們認為兩樣本從相同平均數的母體中抽出")
} else {cat("在95%的置信水平下，我們不認為兩樣本從相同平均數的母體中抽出")}
##方法二
t.test(X,Y)
if(t<1.96){cat("在95%的置信水平下，我們認為兩樣本從相同平均數的母體中抽出")
} else {cat("在95%的置信水平下，我們不認為兩樣本從相同平均數的母體中抽出")}
###t.test(X,Y)是一个针对两组独立的样本t检验，可以用来检验两个总体
###均值相等的假设。


#第7題************************************************************************#
#*************************************(a)*************************************#
M = matrix(rnorm(200,mean=20,sd=4),nrow=1)
for (i in 1:999){
  M = rbind(M,rnorm(200,mean=20,sd=4))
}
dim(M)  #可據此確認所作矩陣無誤，是一个1000行，200列的矩阵。总共200000个元素。
#*************************************(b)*************************************#
mean(rowMeans(M))#指对每行的元素求均值之后，对这些样本均值求均值。即样本均值的均值。

var(rowMeans(M))#指对每行的元素求均值之后，对这些样本均值求方差。即样本均值的方差。
var(M[1,])/200 #每一行的元素求方差之后除以200，会围绕【样本均值的方差】上下波动。
var(M[2,])/200 #这就是Var(Xbar)=Var(X)/n   的含义。
var(M[3,])/200 #取了1000次样，每次取样都包含200个样本。所以n=200。
var(M[4,])/200 #每一行的元素求方差之后除以200，会围绕【样本均值的方差】上下波动。
var(M[5,])/200 #每一行的元素求方差之后除以200，会围绕【样本均值的方差】上下波动。

#*************************************(c)*************************************#
sd(rowMeans(M))  #计算样本均值的标准差
                         #计算样本的标准误
#为什么会有样本均值？因为取了很多次样，每次取样的样本数均为n.
###样本均值的标准差=样本的标准误=样本标准差/根号n,n为每次取样的样本数。
###样本均值标准差=样本标准误
#*************************************(d)*************************************#
hist(rowMeans(M),xlim=c(18,22),ylim=c(0,350))
#從圖形上看，樣本均值近似服從正態分佈。